app/controllers/blogs_controller.rb

SELECT  "blogs".* FROM "blogs" ORDER BY created_at DESC LIMIT $1 OFFSET $2  [["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "blogs"
---
  def index
    if logged_in?(:site_admin)
      @blogs = Blog.recent.page(params[:page]).per(5)

SELECT  "blogs".* FROM "blogs" WHERE "blogs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."blog_id" = $1  [["blog_id", 1]]
---
  def show
    if logged_in?(:site_admin) || @blog.published?
      @blog = Blog.includes(:comments).friendly.find(params[:id])

INSERT INTO "blogs" ("title", "body", "created_at", "updated_at", "slug") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "My blog 00"], ["body", "this is a new"], ["created_at", "2020-01-07 14:59:48.773994"], ["updated_at", "2020-01-07 14:59:48.773994"], ["slug", "my-blog-00"]]
---
  def create
    @blog = Blog.new(blog_params)

    respond_to do |format|
      if @blog.save

UPDATE "blogs" SET "topic_id" = $1, "updated_at" = $2 WHERE "blogs"."id" = $3  [["topic_id", 2], ["updated_at", "2020-03-16 12:28:38.017681"], ["id", 15]]
---
  def update
    respond_to do |format|
      if @blog.update(blog_params)