app/controllers/topics_controller.rb

  def show
    @topic = Topic.find(params[:id])

    if logged_in?(:site_admin)
      @blogs = @topic.blogs.recent.page(params[:page]).per(5)
    else
      @blogs = @topic.blogs.published.page(params[:page]).per(5)
---
SELECT  "topics".* FROM "topics" WHERE "topics"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "blogs".* FROM "blogs" WHERE "blogs"."topic_id" = $1 ORDER BY created_at DESC LIMIT $2 OFFSET $3  [["topic_id", 1], ["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "blogs" WHERE "blogs"."topic_id" = $1  [["topic_id", 1]]